app/controllers/api/visitors_controller.rb

INSERT INTO "visitors" ("lat", "lon", "ip", "user_agent", "created_at", "updated_at") VALUES (-34.6037, -58.3816, '172.23.0.1', 'curl/8.14.1', '2026-01-29 19:12:41.249910', '2026-01-29 19:12:41.249910') RETURNING "id"
---
  def create
    visitor = Visitor.create!(
      lat: params[:lat],
      lon: params[:lon],
      ip: request.remote_ip,
      user_agent: request.user_agent
    )