app/controllers/books_controller.rb

INSERT INTO "reservations" ("book_id", "created_at", "email", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["book_id", 1], ["created_at", "2026-02-19 17:31:20.887791"], ["email", "[FILTERED]"], ["updated_at", "2026-02-19 17:31:20.887791"]]
---
  def reserve
    return render_unavailable unless @book.available?

    @book.with_lock do
      reservation = @book.reservations.create!(reservation_params)