app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    books = Book.all

INSERT INTO "reservations" ("book_id", "email", "created_at", "updated_at") VALUES (10, 'user10@example.com', '2026-02-19 17:45:18.282852', '2026-02-19 17:45:18.282852') RETURNING "id"
UPDATE "books" SET "status" = 1, "updated_at" = '2026-02-19 17:45:18.284625' WHERE "books"."id" = 10
---
  def reserve
    return render_unavailable unless @book.available?

    @book.with_lock do
      reservation = @book.reservations.create!(reservation_params)
      @book.update!(status: :reserved)

SELECT "books".* FROM "books" WHERE "books"."id" = 10 LIMIT 1
---
  def set_book
    @book = Book.find(params[:id])