app/controllers/visitors_map_controller.rb

SELECT "visitors".* FROM "visitors"
---
  def image
    visitors = Visitor.all